serbian = ["Никола", "Лука", "Стефан", "Марко", "Лазар", "Александр", "Филип", "Йован", "Неманя", "Милош", "Душан"]
kazakh = ["Муртаза", "Меджит","Ильяс", "Харун", "Нурадил", "Айрат", "Азиль", "Ерлан"]
yakutian = ["Айхал", "Эркин", "Хорула", "Уруй", "Дуолан", "Дохсун", "Тимир"]

name = input("Введите имя\n")

if name in serbian:
    print("Это имя сербское")
elif name in kazakh:
    print("Это имя казахское")
elif name in yakutian:
    print("Это имя якутское")
else:
    print("Такого имени нет")