# Импортируем библиотеку random для использования функции choice
import random

# Объявляем список слов, список ответов, словарь перевода в Азбуку Морзе
english_words = ["code", "bit", "list", "soul", "next", "house", "flower",
                 "word", "earth", "you", "probably"]
user_answers = []
morse_dict = {
    "0": "-----",
    "1": ".----",
    "2": "..---",
    "3": "...--",
    "4": "....-",
    "5": ".....",
    "6": "-....",
    "7": "--...",
    "8": "---..",
    "9": "----.",
    "a": ".-",
    "b": "-...",
    "c": "-.-.",
    "d": "-..",
    "e": ".",
    "f": "..-.",
    "g": "--.",
    "h": "....",
    "i": "..",
    "j": ".---",
    "k": "-.-",
    "l": ".-..",
    "m": "--",
    "n": "-.",
    "o": "---",
    "p": ".--.",
    "q": "--.-",
    "r": ".-.",
    "s": "...",
    "t": "-",
    "u": "..-",
    "v": "...-",
    "w": ".--",
    "x": "-..-",
    "y": "-.--",
    "z": "--..",
    ".": ".-.-.-",
    ",": "--..--",
    "?": "..--..",
    "!": "-.-.--",
    "-": "-....-",
    "/": "-..-.",
    "@": ".--.-.",
    "(": "-.--.",
    ")": "-.--.-"
}


# Объявляем наши функции
def morse_encode(word):
    """
    Переводит слова на английском языке в последовательности точек и тирe
    """
    # Посимвольно перебираем слово и прибавляем значение из словаря к строке
    return "".join([morse_dict[symbol] for symbol in word])


def get_word(user_list):
    """
    Получает случайное слово из списка
    """
    # Возвращаем случайный элемент из списка слов
    return random.choice(user_list)


def print_statistics(answers):
    """
    На основе списка answers выводит статистику
    """
    print(f"Всего задачек: {len(answers)}")
    # Считаем количества правильных и неправильных ответов
    print(f"Отвечено верно: {answers.count(True)}")
    print(f"Отвечено неверно: {answers.count(False)}")


# Вывод приветствия и инструкции для начала игры
print("Сегодня мы потренируемся расшифровывать морзянку.")
print("Нажмите Enter и начнем")
input()

for i in range(5):
    # Получаем случайное слово из списка
    random_word = get_word(english_words)

    # Вывод случайного слова, запрос ответа у пользователя
    print(f"Слово {i + 1} - {morse_encode(random_word)}")
    user_answer = input("Ответ: ")

    # Проверка верности ответа без учета регистра
    if user_answer.lower() == random_word.lower():
        print(f"Верно, {random_word.capitalize()}!\n")
        # Добавляем верный ответ или нет в список ответов
        user_answers.append(True)
    else:
        print(f"Неверно, {random_word.capitalize()}!\n")
        # Добавляем верный ответ или нет в список ответов
        user_answers.append(False)

# Вывод результатов
print_statistics(user_answers)
